# Словарь для кнопки меню
LEXICON_COMMANDS_MENU_REG: dict[str, str] = {
    "/help": "Помощь",
    "/reset": "Очистить историю сообщений",
    "/about": "О проекте",
    "/style": "Сменить стиль общения",
    "/role": "Роль бота",
    "/cancel": "Отмена",
}


# Словарь для инлайн кнопок
LEXICON_BUTTONS: dict = {
    "Вежливый": "Вежливом",
    "Деловой": "Деловом",
    "Насмешливый": "Насмешливом",
    "Юморной": "Юморном",
    "Неформальный": "Неформальном",
    "Психолог": "Психолог",
    "Друг": "Друг",
    "Враг": "Враг",
    "Пьяный ковбой": "Пьяный ковбой",
}
